package TaskTracker;
public class Main {
    public static void main(String[] args) {

        System.out.println("Поехали!");
    }
}





  /*
Серьезно, я создал все классы (пустые) и в классе Менеджер все методы из ТЗ (тоже пока пустые) =)

        Дальше думаю какие переменные нужны в каждом классе.
        Далее какие конструкторы и методы добавить в классы, которые не Менеджер.
        Далее пойду по каждому отдельному классу из ТЗ для менеджера.

        Сразу отметил для себя, что все что связано с Епиком - оно со звездочкой.
        Добавили подзадачу - пересчитай статусы. Удалили эпик - надо удалить все подзадачи и тп

   */